Дошкольное_учреждение83/src/Catalogs/ФизическиеЛица/ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФизическиеЛица</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <type>
      <types>CatalogRef.ГруппыДоступаФизическихЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>КодИМНС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтраховойНомерПФР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставСемьи</name>
    <attributes>
      <name>СтепеньРодства</name>
      <type>
        <types>CatalogRef.удуСтепениРодстваФизЛиц</types>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРождения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗнаниеЯзыков</name>
    <attributes>
      <name>Язык</name>
      <type>
        <types>CatalogRef.удуЯзыкиНародовМира</types>
      </type>
    </attributes>
    <attributes>
      <name>СтепеньЗнанияЯзыка</name>
      <type>
        <types>CatalogRef.удуСтепениЗнанияЯзыка</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Образование</name>
    <attributes>
      <name>ВидОбразования</name>
      <type>
        <types>CatalogRef.удуВидыОбразованияФизЛиц</types>
      </type>
    </attributes>
    <attributes>
      <name>УчебноеЗаведение</name>
      <type>
        <types>CatalogRef.удуУчебныеЗаведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Специальность</name>
      <type>
        <types>CatalogRef.удуКлассификаторСпециальностейПоОбразованию</types>
      </type>
    </attributes>
    <attributes>
      <name>Диплом</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГодОкончания</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Квалификация</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Профессии</name>
    <attributes>
      <name>Профессия</name>
      <type>
        <types>CatalogRef.удуПрофессииРабочих</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Стажи</name>
    <attributes>
      <name>ВидСтажа</name>
      <type>
        <types>CatalogRef.удуВидыСтажа</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОтсчета</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РазмерМесяцев</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РазмерДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТрудоваяДеятельность</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Награды</name>
    <attributes>
      <name>Награда</name>
      <type>
        <types>CatalogRef.удуНаграды</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерПриказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПриказа</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧейПриказ</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Аттестация</name>
    <attributes>
      <name>ДатаАттестации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РешениеКомиссии</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерПротокола</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПротокола</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Основание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Квалификация</name>
    <attributes>
      <name>НачалоОбучения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеОбучения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидПовышенияКвалификации</name>
      <type>
        <types>CatalogRef.удуВидПовышенияКвалификации</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоПрохожденияОбучения</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерияДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДокумента</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Основание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Дошкольное_учреждение83/src/InformationRegisters/удуГражданствоФизЛиц/удуГражданствоФизЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>удуГражданствоФизЛиц</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Страна</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </resources>
  <resources>
    <name>НеИмеетПравоНаПенсию</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеЯвляетсяНалоговымРезидентомРФ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеИмеетПравоНаМедицинскоеСтрахование</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Дошкольное_учреждение83/src/Catalogs/ФизическиеЛица/Forms/ФормаЗаписиГражданство/Module.bsl
&НаСервере
 Процедура ОбновитьПредставлениеЭлемента(ИмяОбновляемогоЭлемента = "Все")
	
	Если ИмяОбновляемогоЭлемента = "РасшифровкаНДФЛ" или ИмяОбновляемогоЭлемента = "Все" Тогда
		
		Если НеЯвляетсяНалоговымРезидентомРФ Тогда
			Элементы.РасшифровкаНДФЛ.Заголовок = "Физическое лицо за прошедшие 12 месяцев пробыло на территории РФ менее 183 дней. При исчислении НДФЛ с оплаты труда будет применяться ставка 30%.";
		Иначе
			Элементы.РасшифровкаНДФЛ.Заголовок = "Физическое лицо постоянно находится на территории РФ (за прошедшие 12 месяцев - более 183 дней). При исчислении НДФЛ с оплаты труда будет применяться ставка 13%";
		КонецЕсли;
		
	КонецЕсли;
	
	Если ИмяОбновляемогоЭлемента = "РасшифровкаПФР" или ИмяОбновляемогоЭлемента = "Все" Тогда
		
		Если НеИмеетПравоНаПенсию Тогда
			Элементы.РасшифровкаПФР.Заголовок = "На физическое лицо не распространяется обязательное пенсионное, медицинское и социальное страхование в РФ. Таковыми являются иностранные граждане и лица без гражданства, временно пребывающие на территории РФ.";
		Иначе
			Элементы.РасшифровкаПФР.Заголовок = "На физическое лицо распространяется обязательное пенсионное, медицинское и социальное страхование в РФ. Таковыми являются граждане РФ, а также постоянно или временно проживающие на территории РФ иностранные граждане и лица без гражданства.";
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтработатьПереключательГражданство()
	
	Если ПереключательГражданство=1 Тогда
		мСтрана = Страна;
		Страна = Справочники.СтраныМира.ПустаяСсылка();
	Иначе
		Страна = мСтрана;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключательГражданствоПриИзменении(Элемент)
	
	ОтработатьПереключательГражданство();
	
	Элементы.Страна.ТолькоПросмотр = Булево(ПереключательГражданство);
	
КонецПроцедуры

&НаКлиенте
Процедура НеЯвляетсяНалоговымРезидентомРФПриИзменении(Элемент)
	ОбновитьПредставлениеЭлемента("РасшифровкаНДФЛ");
КонецПроцедуры

&НаКлиенте
Процедура НеИмеетПравоНаПенсиюПриИзменении(Элемент)
	ОбновитьПредставлениеЭлемента("РасшифровкаПФР");
КонецПроцедуры

&НаКлиенте
Процедура История(Команда)
	
	ФормаИстории= ПолучитьФорму("РегистрСведений.удуГражданствоФизЛиц.ФормаСписка",,ЭтаФорма);
	ЭлементОтбора=ФормаИстории.Список.Отбор.элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.Использование=Истина;
	ЭлементОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение=ФизЛицо;
	ЭлементОтбора.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("ФизЛицо");
	ФормаИстории.открыть();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтруктураДанных=ПолучитьИзВременногоХранилища(Параметры.АдресНачальныхДанных);
	ЗаполнитьЗначенияСвойств(ЭтаФорма,СтруктураДанных);
	АдресНачальныхДанных=Параметры.АдресНачальныхДанных;
	
	Если ФизЛицо.Пустая() тогда
		Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.История.Видимость=Ложь;
		Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.История.Доступность=Ложь;
	КонецЕсли;
	
	Если не ЗначениеЗаполнено(Период) тогда
		 Период=Дата(1900,01,01);
	КонецЕсли;
	
	
	// установим переключатель в форме в соответствии с выбранным гражданством
	ЛицоБезГражданства = Страна = Справочники.СтраныМира.ЛицоБезГражданства;
	Элементы.Страна.ТолькоПросмотр = ЛицоБезГражданства;
	Если ЛицоБезГражданства Тогда
		Страна = Справочники.СтраныМира.ПустаяСсылка();
		ПереключательГражданство=1;
	КонецЕсли;	
	
	ОбновитьПредставлениеЭлемента();

КонецПроцедуры

&НаСервере
Функция СравнитьДанные()
	
	Перем НачальноеЗначение, КонечноеЗначение;
	
	СтруктураДанных=ПолучитьИзВременногоХранилища(АдресНачальныхДанных);
	СтруктураДанныхНовая=Новый Структура;
	Для Каждого ЭлементСтруктуры из СтруктураДанных цикл
		СтруктураДанныхНовая.Вставить(ЭлементСтруктуры.Ключ,ЭлементСтруктуры.Значение);
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(СтруктураДанныхНовая,ЭтаФорма);
	Если не ЗначениеЗаполнено(Страна) тогда
		  СтруктураДанныхНовая.Страна=Справочники.СтраныМира.ЛицоБезГражданства;
	КонецЕсли;
	
	
	
	ПризнакИзменения=Ложь;
	МассивРеквизитов=ПолучитьРеквизиты();
	
	Для Каждого ЭлементМассива из МассивРеквизитов цикл
		СтруктураДанных.Свойство(ЭлементМассива.Имя, НачальноеЗначение); 
		СтруктураДанныхНовая.Свойство(ЭлементМассива.Имя, КонечноеЗначение);
		Если не НачальноеЗначение=КонечноеЗначение тогда
			 ПризнакИзменения=Истина;
			 Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ПризнакИзменения тогда
         Возврат СтруктураДанныхНовая;
	 Иначе 
		 Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПодтвердитьИзменения(Кнопка)
	
	Закрыть(СравнитьДанные());
	
КонецПроцедуры
